(function f_test() {
    G.EL.f_set_view_box();
    function fy(y) {return -y}
    var Y0 = fy(6.5);
    var Y1 = fy(0);
    var Y2 = fy(-7);
    var Y3 = fy(-13);
    var arr_text = [
        ["012,012,012;   012,012,012;   012,012,012", [0,Y1,0]],   //куб
        ["012,0 2,012;   012,012,012;   012,012,012;2", [5,Y1,0]], //кыб дырка внизу
        ["012,012,012;   012,012, 12;   012,012,012;2", [10,Y1,0]], //куб дырка на ребре

        ["012,0234,012;  012,023,012;   012,23,012", [0,Y0,0]],    //колодец
        ["0123,23,0123;  02,0234,02;     234,234,234", [7,Y0,0]],   //волк прямой зад
        ["0234,0234,0234;012,124,012;   23,23,23", [14,Y0,0]],      //волк зад с дыркой

        ["12,123,12; 2,3,2; 012,1234,012; 1,,1;01,0,01", [1,Y2,0]],//неустойчивая, сверху синяя перекладина
        ["0123,3,0123; 02,0,02; 234,234,234; ,234;,4", [7,Y2,0]],  //неустойчивая, сверху зелёный штырёк
        ["0123,02,0123; 13,0123,13; 1,12,1; 12,2,12", [0,Y3,0]],   //робот 44 шириной 3
        ["024,0234,024; 012345,35,012345;,35;,3", [7,Y3,0]],       //таракан с трубой

        [",1,012;,,0;1,1,01", [15,Y1,0]],  //красный - задвижка
        //["0,0,01;,0,1;,0,01", [15,Y2,0]],  //зелёный - вырез
        ["01,1,01;0,0,0;0", [15,Y2,0]],  //зелёный - вырез
        ["2,2,02;12,,012", [15,Y3,0]]    //синий - узел
    ];

    var i = arr_text.length - 1;
    function f(t) {
        var s = arr_text[i - t];
        var svg_text = G.TRICUBE.f_string_to_svg(s[0],s[1]);
        G.EL.f_add_html(svg_text);
    }
    for (var j = 0; j < arr_text.length; j++) {f(j);}
    
}());